Tekla.Structures.Dialog.Data.IAppliedAttributesSelector
The Tekla.Structures.Dialog.Data.IAppliedAttributesSelector defines the interface for selecting the current applied attributes for any Tekla.Structures.Model.Part instance.

Tekla.Structures.Dialog.Data.IAppliedAttributesSelector.SelectAppliedAttributes(Tekla.Structures.Model.Part,Tekla.Structures.Dialog.Data.MaterialType)
Selects the current applied attributes to the given Tekla.Structures.Model.Part instance.
part: The Tekla.Structures.Model.Part to set the current applied values to.
materialType: The type of material of part.

Tekla.Structures.Dialog.Data.IAppliedAttributesSelector.SelectDefaultEndPoints(Tekla.Structures.Model.Beam,Tekla.Structures.Dialog.Data.MaterialType,Tekla.Common.Geometry.Vector3)
Selects the default end points to column for the given referencePosition.
The Tekla.Structures.Model.Beam.Type property of column must be set to either Tekla.Structures.Model.Beam.BeamTypeEnum.COLUMN or Tekla.Structures.Model.Beam.BeamTypeEnum.PAD_FOOTING.
column: The Tekla.Structures.Model.Beam to set the default Tekla.Structures.Model.Beam.StartPoint and Tekla.Structures.Model.Beam.EndPoint values on.
materialType: The type of material of column.
referencePosition: The reference location to position column against.